// Задайте строку, содержащую латинские буквы в обоих регистрах. Сформируйте строку, 
//в которой все заглавные буквы заменены на строчные.

string str = "aBcD1tf!-";
string lowstr = str.ToLower();
Console.WriteLine(lowstr);
Console.WriteLine("aBcD1tf!-".ToUpper());

//new
